app/controllers/breaths_controller.rb

INSERT INTO "breaths" ("painting_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["painting_id", 1], ["created_at", "2020-06-25 22:50:04.237714"], ["updated_at", "2020-06-25 22:50:04.237714"]]
---
    def create
        @breath = Breath.new(painting_id: params[:painting_id])
        if @breath.save

SELECT "breaths".* FROM "breaths"
---
    def index
        @breaths = Breath.all