app/controllers/bumps_controller.rb

INSERT INTO "bumps" ("painting_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["painting_id", 1], ["created_at", "2020-06-25 22:50:10.350097"], ["updated_at", "2020-06-25 22:50:10.350097"]]
---
    def create
        @bump = Bump.new(painting_id: params[:painting_id])
        if @bump.save

SELECT "bumps".* FROM "bumps"
---
    def index
        @bumps = Bump.all