app/controllers/flashes_controller.rb

    def create
        @flash = Flash.new(painting_id: params[:painting_id])
        if @flash.save
---
INSERT INTO "flashes" ("painting_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["painting_id", 1], ["created_at", "2020-06-25 22:50:16.726942"], ["updated_at", "2020-06-25 22:50:16.726942"]]

    def index
        @flashes = Flash.all
---
SELECT "flashes".* FROM "flashes"