app/controllers/paintings_controller.rb

INSERT INTO "paintings" ("objectID", "created_at", "updated_at") VALUES (?, ?, ?)  [["objectID", 436965], ["created_at", "2020-06-25 22:28:07.749181"], ["updated_at", "2020-06-25 22:28:07.749181"]]
---
    def create
        @painting = Painting.new(
            accessionNumber: params[:accessionNumber]
        )
        if @painting.save

SELECT "paintings".* FROM "paintings" WHERE "paintings"."accessionNumber" = $1 LIMIT $2  [["accessionNumber", "1975.1.231"], ["LIMIT", 1]]
SELECT "paintings".* FROM "paintings"
---
    def index
        if params[:accessionNumber]
            @result = Painting.find_by(accessionNumber: params[:accessionNumber])
        else
            @result = Painting.all