app/controllers/tampers_controller.rb

    def create
        @tamper = Tamper.new(
            painting_id: params[:painting_id],
            significant_tamper: params[:significant_tamper],
            used_program: params[:used_program]
        )
        if @tamper.save
---
INSERT INTO "tampers" ("painting_id", "significant_tamper", "used_program", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["painting_id", 1], ["significant_tamper", 0], ["used_program", 1], ["created_at", "2020-06-26 16:30:20.555762"], ["updated_at", "2020-06-26 16:30:20.555762"]]