app/controllers/touches_controller.rb

    def create
        @touch = Touch.new(painting_id: params[:painting_id])
        if @touch.save
---
INSERT INTO "touches" ("painting_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["painting_id", 1], ["created_at", "2020-06-25 22:49:53.754185"], ["updated_at", "2020-06-25 22:49:53.754185"]]

    def index
        @touches = Touch.all
---
SELECT "touches".* FROM "touches"